{
  "Adam Lindsay Gordon": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/2/26/Adam_Lindsay_Gordon_2.jpeg",
    "desc": "Adam Lindsay Gordon (19 October 1833 – 24 June 1870) was a British-Australian poet, horseman, police officer and politician. He was the first Australian poet to gain considerable recognition overseas, and according to his contemporary, writer Marcus Clarke, Gordon's work represented \"the beginnings of a national school of Australian poetry\"."
  },
  "Alan Seeger": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Alan_Seeger.jpg",
    "desc": "Alan Seeger (22 June 1888 – 4 July 1916) was an American war poet who fought and died in World War I during the Battle of the Somme, serving in the French Foreign Legion. Seeger was the brother of Elizabeth Seeger, a children's author and educator, and Charles Seeger, a noted American pacifist and musicologist; he was also the uncle of folk musicians Pete Seeger, Peggy Seeger, and Mike Seeger. He is lauded for the poem \"I Have a Rendezvous with Death\", a favorite of President John F. Kennedy. A statue representing him is on the monument in the Place des États-Unis, Paris, honoring those American citizens who volunteered to fight for the Third French Republic while their country was still neutral and lost their lives during the war. Seeger is sometimes called the \"American Rupert Brooke\"."
  },
  "Alexander Pope": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Alexander_Pope_by_Michael_Dahl.jpg",
    "desc": "Alexander Pope (21 May 1688 – 30 May 1744) was an English poet known for his satirical verse and for his translation of Homer. He is famous for works like 'The Rape of the Lock' and 'The Dunciad' and is the third-most frequently quoted writer in The Oxford Dictionary of Quotations, after Shakespeare and Tennyson."
  },
  "Algernon Charles Swinburne": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/e/e9/Picture_of_Algernon_C._Swinburne.jpg",
    "desc": "Algernon Charles Swinburne (5 April 1837 – 10 April 1909) was an English poet, playwright, novelist and critic. He wrote many plays - all tragedies - and collections of poetry such as Poems and Ballads, and contributed to the Eleventh Edition of the Encyclopædia Britannica."
  },
  "Ambrose Bierce": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/5/57/Abierce.jpg",
    "desc": "Ambrose Gwinnett Bierce (June 24, 1842 – c. 1914) was an American short story writer, journalist, poet, and American Civil War veteran. His book The Devil's Dictionary was named one of \"The 100 Greatest Masterpieces of American Literature\" by the American Revolution Bicentennial Administration. His story \"An Occurrence at Owl Creek Bridge\" has been described as \"one of the most famous and frequently anthologized stories in American literature\", and his book Tales of Soldiers and Civilians (also published as In the Midst of Life) was named by the Grolier Club one of the 100 most influential American books printed before 1900."
  },
  "Amy Levy": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/8/8a/Amy_Levy_1.jpg",
    "desc": "Amy Judith Levy (10 November 1861 – 9 September 1889) was an English essayist, poet, and novelist best remembered for her literary gifts; her experience as the second Jewish woman at Cambridge University, and as the first Jewish student at Newnham College, Cambridge; her feminist positions; her friendships with others living what came later to be called a \"New Woman\" life, some of whom were lesbians; and her relationships with both women and men in literary and politically activist circles in London during the 1880s."
  },
  "Andrew Marvell": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/1/16/Andrew_Marvell.jpg",
    "desc": "Andrew Marvell (31 March 1621 – 16 August 1678) was an English metaphysical poet, satirist and politician who sat in the House of Commons at various times between 1659 and 1678. During the Commonwealth period he was a colleague and friend of John Milton. His poems range from the love-song \"To His Coy Mistress\", to evocations of an aristocratic country house and garden in \"Upon Appleton House\" and \"The Garden\", the political address \"An Horatian Ode upon Cromwell's Return from Ireland\", and the later personal and political satires \"Flecknoe\" and \"The Character of Holland\"."
  },
  "Ann Taylor": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/3/37/Ann_Taylor.jpg",
    "desc": "Ann Gilbert (née Taylor; 30 January 1782 – 20 December 1866) was an English poet and literary critic. She gained lasting popularity in her youth as a writer of verse for children. In the years up to her marriage, she became an astringent literary critic. However, she is best remembered as the elder sister and collaborator of Jane Taylor."
  },
  "Anne Bradstreet": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/8/82/Frontispiece_for_An_Account_of_Anne_Bradstreet_The_Puritan_Poetess%2C_and_Kindred_Topics%2C_edited_by_Colonel_Luther_Caldwell_%28Boston%2C_1898%29_%28cropped%29.jpg",
    "desc": "Anne Bradstreet (née Dudley; March 8, 1612 – September 16, 1672) was among the most prominent of early English poets of North America and first writer in England's North American colonies to be published. She is the first Puritan figure in American Literature and notable for her large corpus of poetry, as well as personal writings published posthumously."
  },
  "Anne Bronte": {
    "img": "https://ebbg7broonn.exactdn.com/wp-content/uploads/2024/06/Anne-Bronte-Artistic-Portrait.jpg?strip=all&lossy=1&ssl=1",
    "desc": "Anne Brontë (17 January 1820 – 28 May 1849) was an English novelist and poet, the youngest member of the Brontë literary family."
  },
  "Anne Killigrew": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/7/78/Anne_Killigrew%2C_Portrait_of_a_Lady%2C_Private_Collection%2C_Scotland.jpg",
    "desc": "Anne Killigrew (1660–1685) was an English poet and painter, described by contemporaries as \"A Grace for beauty, and a Muse for wit.\" Born in London, she and her family were active in literary and court circles. Killigrew's poems were circulated in manuscript and collected and published posthumously in 1686 after she died from smallpox at age 25. They have been reprinted several times by modern scholars, most recently and thoroughly by Margaret J. M. Ezell."
  },
  "Anne Kingsmill Finch": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/1/18/Anne-Finch.jpeg",
    "desc": "Anne Finch, Countess of Winchilsea (née Kingsmill; April 1661 – 5 August 1720), was an English poet and courtier. Finch wrote in many genres and on many topics - including fables, odes, songs, and religious verse - which are informed by \"political ideology, religious orientation, and aesthetic sensibility\". Her works also allude to other female authors of the time, such as Aphra Behn and Katherine Phillips. Through her commentary on the mental and spiritual equality of the sexes and the importance of women fulfilling their potential as a moral duty to themselves and to society, she is regarded as one of the integral female poets of the Augustan Era. Finch died in Westminster in 1720 and was buried at her home at Eastwell, Kent."
  },
  "Annie Louisa Walker": {
    "img": "https://mypoeticside.com/wp-content/uploads/gallery-images/00b338f.jpeg",
    "desc": "Anna (Annie) Louisa Walker (23 June 1836 in Staffordshire – 7 July 1907 in Bath, Somerset) was an English and Canadian teacher and author. She wrote five novels and two collections of poetry and edited an autobiography. Her poem \"The Night Cometh\" provides the text of the popular hymn \"Work, for the night is coming\"."
  },
  "Arthur Hugh Clough": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Arthur_Hugh_Clough_1860.jpg",
    "desc": "Arthur Hugh Clough (1 January 1819 – 13 November 1861) was an English poet, an educationalist, and the devoted assistant to Florence Nightingale. He was the brother of suffragist Anne Clough and father of Blanche Athena Clough, who both became principals of Newnham College, Cambridge."
  },
  "Ben Jonson": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/1/13/Benjamin_Jonson_by_Abraham_van_Blyenberch.jpg",
    "desc": "Benjamin Jonson (c. 11 June 1572 – 18 August [O.S. 6 August] 1637) was an English playwright and poet. Jonson's artistry exerted a lasting influence on English poetry and stage comedy. He popularised the comedy of humours; he is best known for the satirical plays Every Man in His Humour (1598), Volpone, or The Fox (c. 1606), The Alchemist (1610) and Bartholomew Fair (1614) and for his lyric and epigrammatic poetry. He is regarded as \"the second most important English dramatist, after William Shakespeare, during the reign of James I.\""
  },
  "Charles Kingsley": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/2/28/Charles_Kingsley._Photograph_by_Charles_Watkins._Wellcome_V0026646.jpg",
    "desc": "Charles Kingsley (12 June 1819 – 23 January 1875) was a broad church priest of the Church of England, a university professor, social reformer, historian, novelist and poet. He is particularly associated with Christian socialism, the working men's college, and forming labour cooperatives, which failed, but encouraged later working reforms."
  },
  "Charles Sorley": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Charles_Hamilton_Sorley_%28For_Remembrance%29_cropped_and_retouched.jpg",
    "desc": "Captain Charles Hamilton Sorley (19 May 1895 – 13 October 1915) was a British Army officer and Scottish war poet who fought in the First World War. He was killed in action during the Battle of Loos in October 1915."
  },
  "Charlotte Bronte": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/3/3a/CBRichmond.png",
    "desc": "Charlotte Nicholls (21 April 1816 – 31 March 1855), commonly known as Charlotte Brontë was an English novelist and poet, the eldest of the three Brontë sisters who survived into adulthood and whose novels became classics of English literature. She is best known for her novel Jane Eyre, which she published under the male pseudonym Currer Bell. Jane Eyre went on to become a success in publication, and is widely held in high regard in the gothic fiction genre of literature."
  },
  "Charlotte Smith": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/f/fc/CharlotteSmith.jpg",
    "desc": "Charlotte Smith (née Turner; 4 May 1749 – 28 October 1806) was an English novelist and poet of the School of Sensibility whose Elegiac Sonnets (1784) contributed to the revival of the form in England. She also helped to set conventions for Gothic fiction and wrote political novels of sensibility. Despite ten novels, four children's books and other works, she saw herself mainly as a poet and expected to be remembered for that."
  },
  "Christina Rossetti": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Christina_Rossetti_3.jpg",
    "desc": "Christina Georgina Rossetti (5 December 1830 – 29 December 1894) was an English writer of romantic, devotional and children's poems, including \"Goblin Market\" and \"Remember\". She also wrote the words of two Christmas carols well known in Britain: \"In the Bleak Midwinter\", later set by Gustav Holst, Katherine Kennicott Davis, and Harold Darke, and \"Love Came Down at Christmas\", also set by Darke and other composers. She was a sister of the artist and poet Dante Gabriel Rossetti and features in several of his paintings."
  },
  "Christopher Marlowe": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/0/09/Christopher_Marlowe.jpg",
    "desc": "Christopher Marlowe (baptised 26 February 1564 – 30 May 1593), also known as Kit Marlowe, was an English playwright, poet, and translator of the Elizabethan era. Marlowe is among the most famous of the Elizabethan playwrights. Based upon the \"many imitations\" of his play Tamburlaine, modern scholars consider him to have been the foremost dramatist in London in the years just before his mysterious early death. Some scholars also believe that he greatly influenced William Shakespeare, who was baptised in the same year as Marlowe and later succeeded him as the preeminent Elizabethan playwright. Marlowe was the first to achieve critical reputation for his use of blank verse, which became the standard for the era. His plays are distinguished by their overreaching protagonists. Themes found within Marlowe's literary works have been noted as humanistic with realistic emotions, which some scholars find difficult to reconcile with Marlowe's \"anti-intellectualism\" and his catering to the prurient tastes of his Elizabethan audiences for generous displays of extreme physical violence, cruelty, and bloodshed."
  },
  "Christopher Smart": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Christopher_Smart.jpg",
    "desc": "Christopher Smart (11 April 1722 – 20 May 1771) was an English poet. He was a major contributor to two popular magazines, The Midwife and The Student, and a friend to influential cultural icons like Samuel Johnson and Henry Fielding. Smart, a high church Anglican, was widely known throughout London."
  },
  "Coventry Patmore": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/a/a7/Portrait_of_Coventry_Patmore.jpg",
    "desc": "Coventry Kersey Dighton Patmore (23 July 1823 – 26 November 1896) was an English poet and literary critic. He is best known for his book of poetry The Angel in the House, a narrative poem about the Victorian ideal of a happy marriage. As a young man, Patmore worked for the British Museum in London. After the publication of his first book of poems in 1844, he became acquainted with members of the Pre-Raphaelite Brotherhood. After the death of his first wife, Emily Augusta Patmore in 1862, his grief over her death became a major theme in his poetry."
  },
  "Edgar Allan Poe": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/9/97/Edgar_Allan_Poe%2C_circa_1849%2C_restored%2C_squared_off.jpg",
    "desc": "Edgar Allan Poe (né Edgar Poe; January 19, 1809 – October 7, 1849) was an American writer, poet, editor, and literary critic who is best known for his poetry and short stories, particularly his tales involving mystery and the macabre. He is widely regarded as one of the central figures of Romanticism and Gothic fiction in the United States, and of early American literature. Poe was one of the country's first successful practitioners of the short story, and is generally considered to be the inventor of the detective fiction genre. In addition, he is credited with contributing significantly to the emergence of science fiction. He is the first well-known American writer to earn a living by writing alone, which resulted in a financially difficult life and career."
  },
  "Edmund Spenser": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/6/65/Edmund_Spenser_oil_painting.JPG",
    "desc": "Edmund Spenser ( born 1552 or 1553; died 13 January O.S. 1599) was an English poet best known for The Faerie Queene, an epic poem and fantastical allegory celebrating the Tudor dynasty and Elizabeth I. He is recognized as one of the premier craftsmen of nascent Modern English verse, and he is considered one of the great poets in the English language."
  },
  "Edward Fitzgerald": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Edward_FitzGerald.jpg",
    "desc": "Edward FitzGerald or Fitzgerald (31 March 1809 – 14 June 1883) was an English poet and writer. His most famous poem is the first and best-known English translation of The Rubaiyat of Omar Khayyam, which has kept its reputation and popularity since the 1860s."
  },
  "Edward Lear": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/c/ce/Edward_Lear_1866.jpg",
    "desc": "Edward Lear (12 May 1812 – 29 January 1888) was an English artist, illustrator, musician, author and poet, who is known mostly for his literary nonsense in poetry and prose and especially his limericks, a form he popularised."
  },
  "Edward Taylor": {
    "img": "https://mypoeticside.com/wp-content/uploads/gallery-images/9f3fbd4.jpeg",
    "desc": "Edward Taylor (c.1642 – June 29, 1729) was a colonial American poet, pastor and physician of English origin. His work remained unpublished for some 200 years but since then has established him as one of the foremost writers of his time. His poetry has been characterized as \"American Baroque\" as well as Metaphysical."
  },
  "Edward Thomas": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/7/76/Edward_Thomas.jpg",
    "desc": "Philip Edward Thomas (3 March 1878 – 9 April 1917) was a British writer of poetry and prose. He is sometimes considered a war poet, although few of his poems deal directly with his war experiences. He only started writing poetry at the age of 36, but by that time he had already been a prolific critic, biographer, nature writer and travel writer for two decades. In 1915, he enlisted in the British Army to fight in the First World War and was killed in action during the Battle of Arras in 1917, soon after he arrived in France."
  },
  "Eliza Cook": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Eliza_Cook_by_William_Etty.jpg",
    "desc": "Eliza Cook (24 December 1818 – 23 September 1889) was an English author and poet associated with the Chartist movement. She was a proponent of political freedom for women, and believed in the ideology of self-improvement through education, something she called \"levelling up.\" This made her hugely popular with the working class public in both England and America."
  },
  "Elizabeth Barrett Browning": {
    "img": "https://ebbg7broonn.exactdn.com/wp-content/uploads/2021/01/Elizabeth-Barrett-Browning-Portrait.jpg?strip=all&lossy=1&ssl=1",
    "desc": "Elizabeth Barrett Browning (6 March 1806 – 29 June 1861) was an English poet of the Victorian era, popular in Britain and the United States during her lifetime and frequently anthologised after her death. Her work received renewed attention following the feminist scholarship of the 1970s and 1980s, and greater recognition of women writers in English. Born in County Durham, the eldest of 12 children, Elizabeth Barrett wrote poetry from the age of eleven. Her mother's collection of her poems forms one of the largest extant collections of juvenilia by any English writer. At 15, she became ill, suffering intense head and spinal pain for the rest of her life. Later in life, she also developed lung problems, possibly tuberculosis. She took laudanum for the pain from an early age, which is likely to have contributed to her frail health."
  },
  "Emily Bronte": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/f/fc/Emily_Bront%C3%AB_by_Patrick_Branwell_Bront%C3%AB_restored.jpg",
    "desc": "Emily Jane Brontë (30 July 1818 – 19 December 1848) was an English novelist and poet who is best known for her only novel, Wuthering Heights, now considered a classic of English literature. She also published a book of poetry with her sisters Charlotte and Anne titled Poems by Currer, Ellis and Acton Bell with her own poems finding regard as poetic genius. Emily was the second-youngest of the four surviving Brontë siblings, between the youngest Anne and her brother Branwell. She published under the pen name Ellis Bell."
  },
  "Emily Dickinson": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/5/56/Black-white_photograph_of_Emily_Dickinson2.png",
    "desc": "Emily Elizabeth Dickinson (December 10, 1830 – May 15, 1886) was an American poet. Little-known during her life, she has since been regarded as one of the most important figures in American poetry. Dickinson was born in Amherst, Massachusetts, into a prominent family with strong ties to its community. After studying at the Amherst Academy for seven years in her youth, she briefly attended the Mount Holyoke Female Seminary before returning to her family's home in Amherst. Evidence suggests that Dickinson lived much of her life in isolation. Considered an eccentric by locals, she developed a penchant for white clothing and was known for her reluctance to greet guests or, later in life, even to leave her bedroom. Dickinson never married, and most of her friendships were based entirely upon correspondence."
  },
  "Emma Lazarus": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/8/83/Emmalazarusengraving.jpg",
    "desc": "Emma Lazarus (July 22, 1849 – November 19, 1887) was an American author of poetry, prose, and translations, as well as an activist for Jewish and Georgist causes. She is remembered for writing the sonnet \"The New Colossus\", which was inspired by the Statue of Liberty, in 1883. Its lines appear inscribed on a bronze plaque, installed in 1903, on the pedestal of the Statue of Liberty. Lazarus was involved in aiding refugees to New York who had fled antisemitic pogroms in eastern Europe, and she saw a way to express her empathy for these refugees in terms of the statue. The last lines of the sonnet were set to music by Irving Berlin as the song \"Give Me Your Tired, Your Poor\" for the 1949 musical Miss Liberty, which was based on the sculpting of the Statue of Liberty (Liberty Enlightening the World). The latter part of the sonnet was also set by Lee Hoiby in his song \"The Lady of the Harbor\" written in 1985 as part of his song cycle \"Three Women\"."
  },
  "Ernest Dowson": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Ernest_Dowson.jpg",
    "desc": "Ernest Christopher Dowson (2 August 1867 – 23 February 1900) was an English poet, novelist, and short-story writer who is often associated with the Decadent movement."
  },
  "Eugene Field": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/1/1f/Eugene_Field_cph.3b08726.jpg",
    "desc": "Eugene Field Sr. (September 2, 1850 – November 4, 1895) was an American writer, best known for his children's poetry and humorous essays. He was known as the \"poet of childhood\"."
  },
  "Francis Thompson": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/d/de/Francis_Thompson_at_19.jpg",
    "desc": "Francis Joseph Thompson (16 December 1859 – 13 November 1907) was an English poet and Catholic mystic. At the behest of his father, a doctor, he entered medical school at the age of 18, but at 26 left home to pursue his talent as a writer and poet. He spent three years on the streets of London, supporting himself with menial labour, becoming addicted to opium which he took to relieve a nervous problem."
  },
  "Geoffrey Chaucer": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/5/57/Chaucer_manuscrit_portrait_%28d%C3%A9tail%29.jpeg",
    "desc": "Geoffrey Chaucer (c. 1343 – 25 October 1400) was an English poet, author, and civil servant best known for The Canterbury Tales. He has been called the \"father of English literature\", or, alternatively, the \"father of English poetry\". He was the first writer to be buried in what has since come to be called Poets' Corner, in Westminster Abbey. Chaucer also gained fame as a philosopher and astronomer, composing the scientific A Treatise on the Astrolabe for his 10-year-old son, Lewis. He maintained a career in the civil service as a bureaucrat, courtier, diplomat, and member of parliament."
  },
  "George Eliot": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/4/48/George_Eliot%2C_por_Fran%C3%A7ois_D%27Albert_Durade.jpg",
    "desc": "Mary Ann Evans (22 November 1819 – 22 December 1880; alternatively Mary Anne or Marian), known by her pen name George Eliot, was an English novelist, poet, journalist, translator, and one of the leading writers of the Victorian era. She wrote seven novels: Adam Bede (1859), The Mill on the Floss (1860), Silas Marner (1861), Romola (1862–1863), Felix Holt, the Radical (1866), Middlemarch (1871–1872) and Daniel Deronda (1876). As with Charles Dickens and Thomas Hardy, she emerged from provincial England; most of her works are set there. Her works are known for their realism, psychological insight, sense of place and detailed depiction of the countryside. Middlemarch was described by the novelist Virginia Woolf as \"one of the few English novels written for grown-up people\" and by Martin Amis and Julian Barnes as the greatest novel in the English language."
  },
  "George Gordon, Lord Byron": {
    "img": "https://historia.nationalgeographic.com.es/medio/2021/01/20/fototeca9x12-712654_9baa7048_550x857.jpg",
    "desc": "George Gordon Byron, 6th Baron Byron, FRS (22 January 1788 – 19 April 1824) was a British poet and peer. He is one of the major figures of the Romantic movement, and is regarded as being among the greatest of British poets. Among his best-known works are the lengthy narratives Don Juan and Childe Harold's Pilgrimage; many of his shorter lyrics in Hebrew Melodies also became popular."
  },
  "George Herbert": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/8/80/George_Herbert.jpg",
    "desc": "George Herbert (3 April 1593 – 1 March 1633) was an English poet, orator, and priest of the Church of England. His poetry is associated with the writings of the metaphysical poets, and he is recognised as \"one of the foremost British devotional lyricists.\" He was born in Wales into an artistic and wealthy family and largely raised in England. He received a good education that led to his admission to Trinity College, Cambridge, in 1609. He went there with the intention of becoming a priest, but he became the University's Public Orator and attracted the attention of King James I. He sat in the Parliament of England in 1624 and briefly in 1625."
  },
  "George Meredith": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/2/25/George_Meredith_by_George_Frederic_Watts.jpg",
    "desc": "George Meredith OM (12 February 1828 – 18 May 1909) was an English novelist and poet of the Victorian era. At first, his focus was poetry, influenced by John Keats among others, but Meredith gradually established a reputation as a novelist. The Ordeal of Richard Feverel (1859) briefly scandalised Victorian literary circles. Of his later novels, the most enduring is The Egoist (1879), though in his lifetime his greatest success was Diana of the Crossways (1885). His novels were innovative in their attention to characters' psychology, and also portrayed social change. His style, in both poetry and prose, was noted for its syntactic complexity; Oscar Wilde likened it to ”chaos illumined by brilliant flashes of lightning”  Meredith was an encourager of other novelists, as well as an influence on them; among those to benefit were Robert Louis Stevenson and George Gissing. Meredith was nominated for the Nobel Prize in Literature seven times."
  },
  "Gerard Manley Hopkins": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/7/72/GerardManleyHopkins.jpg",
    "desc": "Gerard Manley Hopkins SJ (28 July 1844 – 8 June 1889) was an English poet and Jesuit priest, whose posthumous fame places him among the leading English poets. His prosody – notably his concept of sprung rhythm – established him as an innovator, as did his praise of God through vivid use of imagery and nature."
  },
  "Helen Hunt Jackson": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/3/3c/Helen_Hunt_Jackson_by_Charles_F._Conly.jpg",
    "desc": "Helen Hunt Jackson (pen name, H.H.; born Helen Maria Fiske; October 15, 1830 – August 12, 1885) was an American poet and writer who became an activist on behalf of improved treatment of Native Americans by the United States government. She described the adverse effects of government actions in her history A Century of Dishonor (1881). Her popular novel Ramona (1884) dramatized the federal government's mistreatment of Native Americans in Southern California after the Mexican–American War and attracted considerable attention to her cause. Commercially successful, it was estimated to have been reprinted 300 times, with readers liking its romantic and picturesque qualities more than its political content.The novel was so popular that it attracted many tourists to Southern California who wanted to see places from the book."
  },
  "Henry David Thoreau": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Benjamin_D._Maxham_-_Henry_David_Thoreau_-_Restored_-_greyscale_-_straightened.jpg",
    "desc": "Henry David Thoreau (July 12, 1817 – May 6, 1862) was an American naturalist, essayist, poet, and philosopher. A leading transcendentalist,he is best known for his book Walden, a reflection upon simple living in natural surroundings, and his essay \"Civil Disobedience\" (originally published as \"Resistance to Civil Government\"), an argument in favor of citizen disobedience against an unjust state."
  },
  "Henry Vaughan": {
    "img": "https://literariness.org/wp-content/uploads/2020/07/dfds.png",
    "desc": "Henry Vaughan (17 April 1621 – 23 April 1695) was a Welsh metaphysical poet, author and translator writing in English, and a medical physician. His religious poetry appeared in Silex Scintillans in 1650, with a second part in 1655. In 1646 his Poems, with the Tenth Satire of Juvenal Englished was published. Meanwhile he had been persuaded by reading the religious poet George Herbert to renounce \"idle verse\". The prose Mount of Olives and Solitary Devotions (1652) show his authenticity and depth of convictions. Two more volumes of secular verse followed, ostensibly without his sanction, but it is his religious verse that has been acclaimed. He also translated short moral and religious works and two medical works in prose. In the 1650s he began a lifelong medical practice."
  },
  "Henry Wadsworth Longfellow": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/a/a7/Henry_Wadsworth_Longfellow%2C_photographed_by_Julia_Margaret_Cameron_in_1868.jpg",
    "desc": "Henry Wadsworth Longfellow (February 27, 1807 – March 24, 1882) was an American poet and educator. His original works include the poems \"Paul Revere's Ride\", \"The Song of Hiawatha\", and \"Evangeline\". He was the first American to completely translate Dante Alighieri's Divine Comedy and was one of the fireside poets from New England."
  },
  "Hugh Henry Brackenridge": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/0/08/Hugh_Henry_Brackenridge_%281748_%E2%80%93_June_25%2C_1816%29_-_Gilbert_Stuart.jpg",
    "desc": "Hugh Henry Brackenridge (1748 – June 25, 1816) was an American writer, lawyer, judge, and justice of the Supreme Court of Pennsylvania."
  },
  "Isaac Watts": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/9/9d/Isaac_Watts_from_NPG.jpg",
    "desc": "Isaac Watts (17 July 1674 – 25 November 1748) was an English Congregational minister, hymn writer, theologian, and logician. He was a prolific and popular hymn writer and is credited with some 750 hymns. His works include \"When I Survey the Wondrous Cross\", \"Joy to the World\", and \"O God, Our Help in Ages Past\". He is recognised as the \"Godfather of English Hymnody\"; many of his hymns remain in use today and have been translated into numerous languages."
  },
  "James Henry Leigh Hunt": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/7/72/James_Henry_Leigh_Hunt_by_Benjamin_Robert_Haydon.jpg",
    "desc": "James Henry Leigh Hunt (19 October 1784 – 28 August 1859), best known as Leigh Hunt, was an English critic, essayist and poet."
  },
  "James Thomson": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Stephen_Slaughter_-_James_Thomson_%281700-1748%29_-_Google_Art_Project.jpg",
    "desc": "James Thomson (c. 11 September 1700 – 27 August 1748) was a Scottish poet and playwright, known for his poems The Seasons and The Castle of Indolence, and for the lyrics of \"Rule, Britannia!\""
  },
  "James Whitcomb Riley": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/4/46/James_Whitcomb_Riley%2C_1913.jpg",
    "desc": "James Whitcomb Riley (October 7, 1849 – July 22, 1916) was an American writer, poet, and best-selling author. During his lifetime he was known as the \"Hoosier Poet\" and \"Children's Poet\" for his dialect works and his children's poetry. His poems tend to be humorous or sentimental. Of the approximately 1,000 poems Riley wrote, the majority are in dialect. His famous works include \"Little Orphant Annie\" and \"The Raggedy Man\"."
  },
  "Jane Austen": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/c/cc/CassandraAusten-JaneAusten%28c.1810%29_hires.jpg",
    "desc": "Jane Austen (16 December 1775 – 18 July 1817) was an English novelist known primarily for her six novels, which implicitly interpret, critique, and comment upon the English landed gentry at the end of the 18th century. Austen's plots often explore the dependence of women on marriage for the pursuit of favourable social standing and economic security. Her works are implicit critiques of the novels of sensibility of the second half of the 18th century and are part of the transition to 19th-century literary realism. Her use of social commentary, realism, wit, and irony have earned her acclaim amongst critics and scholars."
  },
  "Jane Taylor": {
    "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSLot46KFQkQVJoTEoxdCcjjJJRksRmLKn2yUeQiwtbg0ghDdKLkIcqXfqnkbQ3vo4ZP_xRAgOrc8Gt2MWpSpXd1Q",
    "desc": "Jane Taylor (23 September 1783 – 13 April 1824) was an English poet and novelist best known for the lyrics of the widely known \"Twinkle, Twinkle, Little Star\". The sisters Jane and Ann Taylor and their authorship of various works have often been confused, partly because their early ones were published together. Ann Taylor's son, Josiah Gilbert, wrote in her biography, \"Two little poems – 'My Mother,' and 'Twinkle, twinkle, little Star' – are perhaps more frequently quoted than any; the first, a lyric of life, was by Ann, the second, of nature, by Jane; and they illustrate this difference between the sisters.\""
  },
  "John Clare": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/a/ae/John_Clare.jpg",
    "desc": "John Clare (13 July 1793 – 20 May 1864) was an English poet. The son of a farm labourer, he became known for his celebrations of the English countryside and his sorrows at its disruption. His work underwent major re-evaluation in the late 20th century; he is now often seen as a major 19th-century poet. His biographer Jonathan Bate called Clare \"the greatest labouring-class poet that England has ever produced. No one has ever written more powerfully of nature, of a rural childhood, and of the alienated and unstable self.\""
  },
  "John Donne": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/9/96/John_Donne_by_Isaac_Oliver.jpg",
    "desc": "John Donne (1571 or 1572 – 31 March 1631) was an English poet, scholar, soldier and secretary born into a recusant family, who later became a cleric in the Church of England. Under Royal Patronage, he was made Dean of St Paul's Cathedral in London (1621–1631). He is considered the preeminent representative of the metaphysical poets. His poetical works are noted for their metaphorical and sensual style and include sonnets, love poems, religious poems, Latin translations, epigrams, elegies, songs and satires. He is also known for his sermons."
  },
  "John Dryden": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/e/e1/John_Dryden_portrait_painting.jpg",
    "desc": "John Dryden ( 19 August [O.S. 9 August] 1631 – 12 May [O.S. 1 May] 1700) was an English poet, literary critic, translator, and playwright who in 1668 was appointed England's first Poet Laureate."
  },
  "John Greenleaf Whittier": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/e/e2/John_Greenleaf_Whittier_portrait.jpg",
    "desc": "John Greenleaf Whittier (December 17, 1807 – September 7, 1892) was an American Quaker poet and advocate of the abolition of slavery in the United States. Frequently listed as one of the fireside poets, he was influenced by the Scottish poet Robert Burns. Whittier is remembered particularly for his anti-slavery writings, as well as his 1866 book Snow-Bound."
  },
  "John Keats": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/1/1a/John_Keats_by_William_Hilton.jpg",
    "desc": "John Keats (31 October 1795 – 23 February 1821) was an English poet of the second generation of Romantic poets, along with Lord Byron and Percy Bysshe Shelley. His poems had been in publication for less than four years when he died of tuberculosis at the age of 25. They were indifferently received in his lifetime, but his fame grew rapidly after his death. By the end of the century, he was placed in the canon of English literature, strongly influencing many writers of the Pre-Raphaelite Brotherhood; the Encyclopædia Britannica of 1888 called one ode \"one of the final masterpieces\"."
  },
  "John McCrae": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/0/08/John_McCrae_in_uniform_circa_1914.jpg",
    "desc": "Lieutenant-Colonel John McCrae (November 30, 1872 – January 28, 1918) was a Canadian poet, physician, author, artist and soldier during World War I and a surgeon during the Second Battle of Ypres, in Belgium. He is best known for writing the famous war memorial poem \"In Flanders Fields\". McCrae died of pneumonia near the end of the war. His famous poem is a threnody, a genre of lament."
  },
  "John Milton": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/2/2c/John_Milton_Christ%27s_College.jpg",
    "desc": "John Milton (9 December 1608 – 8 November 1674) was an English poet, polemicist, and civil servant. His 1667 epic poem Paradise Lost, written in blank verse and including twelve books, was written in a time of immense religious flux and political upheaval. It addressed the fall of man, including the temptation of Adam and Eve by the fallen angel Satan and God's expulsion of them from the Garden of Eden. Paradise Lost elevated Milton's reputation as one of history's greatest poets. He also served as a civil servant for the Commonwealth of England under its Council of State and later under Oliver Cromwell."
  },
  "John Trumbull": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Self_Portrait_by_John_Trumbull_circa_1802.jpeg",
    "desc": "John Trumbull (June 6, 1756 – November 10, 1843) was an American painter and military officer best known for his historical paintings of the American Revolutionary War, of which he was a veteran. He has been called the \"Painter of the Revolution\". Trumbull's Declaration of Independence (1817), one of his four paintings that hang in the United States Capitol rotunda, is used on the reverse of the current United States two-dollar bill."
  },
  "John Wilmot": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/e/e3/John_Wilmot.jpg",
    "desc": "John Wilmot, 2nd Earl of Rochester (1 April 1647 (O.S.) – 26 July 1680 (O.S.)) was an English poet and courtier of King Charles II's Restoration court, who reacted against the \"spiritual authoritarianism\" of the Puritan era. Rochester embodied this new era, and he became as well known for his rakish lifestyle as for his poetry, although the two were often interlinked. He died as a result of a sexually transmitted infection at the age of 33."
  },
  "Jonathan Swift": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/4/4b/Jonathan_Swift_by_Charles_Jervas_detail.jpg",
    "desc": "Jonathan Swift (30 November 1667 – 19 October 1745) was an Anglo-Irish writer who became Dean of St Patrick's Cathedral, Dublin,hence his common sobriquet, \"Dean Swift\"."
  },
  "Joseph Warton": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/1/18/Joseph_Warton.jpg",
    "desc": "Joseph Warton (April 1722 – 23 February 1800) was an English clergyman, academic, and literary critic."
  },
  "Joyce Kilmer": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Kilmer_1908_columbia_yearbook_picture.png",
    "desc": "Alfred Joyce Kilmer (December 6, 1886 – July 30, 1918) was an American writer and poet mainly remembered for a short poem titled \"Trees\" (1913), which was published in the collection Trees and Other Poems in 1914. Though a prolific poet whose works celebrated the common beauty of the natural world as well as his Catholic faith, Kilmer was also a journalist, literary critic, lecturer, and editor. At the time of his deployment to Europe during World War I, Kilmer was considered the leading American Catholic poet and lecturer of his generation, whom critics often compared to British contemporaries G. K. Chesterton (1874–1936) and Hilaire Belloc (1870–1953). He enlisted in the New York National Guard and was deployed to France with the 69th Infantry Regiment (the famous \"Fighting 69th\") in 1917. He was killed by a sniper's bullet at the Second Battle of the Marne in 1918 at the age of 31. He was married to Aline Murray, also an accomplished poet and author, with whom he had five children."
  },
  "Julia Ward Howe": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/a/a8/JuliaWardHowe_2_%28cropped%29.jpg",
    "desc": "Julia Ward Howe (May 27, 1819 – October 17, 1910) was an American author and poet, known for writing the \"Battle Hymn of the Republic\" as new lyrics to an existing song, and the original 1870 pacifist Mothers' Day Proclamation. She was also an advocate for abolitionism and a social activist, particularly for women's suffrage."
  },
  "Jupiter Hammon": {
    "img": "https://npr.brightspotcdn.com/dims4/default/ae241c5/2147483647/strip/true/crop/440x440+0+0/resize/1760x1760!/format/webp/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F11%2F81%2F645f5df649d3a58f9f233b8b9028%2Fshow-photo-icon2.jpg",
    "desc": "Jupiter Hammon (October 17, 1711 – c. 1806) was an American writer who is known as a founder of African-American literature, as his poem published in 1761 in New York was the first by an African American man in North America. He subsequently published both poetry and prose. In addition, he was a preacher and a commercial clerk on Long Island, New York."
  },
  "Katherine Philips": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Portrait_of_Catherine_Phillips_%284671783_cropped%29.jpg",
    "desc": "Katherine or Catherine Philips (née Fowler; 1 January 1631/2 – 22 June 1664), also known as \"The Matchless Orinda\", was an Anglo-Welsh royalist poet, translator, and woman of letters. She achieved renown as a translator of Pierre Corneille's Pompée and Horace, and for her editions of poetry after her death. She was highly regarded by many notable later writers, including John Dryden and John Keats, as being influential."
  },
  "Lady Mary Chudleigh": {
    "img": "https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcT4yqJ-k6bMNgHKMKvWY2Zd2idY8yMcsO4eHzyFHUrS-CHP7MhoTMX8cEUFToB05bKDIYHj8IoV1OBLEMRspZ9HOQ",
    "desc": "Mary, Lady Chudleigh (née Mary Lee; August 1656–1710) was an English poet who belonged to an intellectual circle that included Mary Astell, Elizabeth Thomas, Judith Drake, Elizabeth Elstob, Lady Mary Wortley Montagu, and John Norris. In her later years she published a volume of poetry and two volumes of essays, all dealing with feminist themes. Two of her books were published in four editions during the last ten years of her life. Her poetry on the subject of human relationships and reactions has appeared in several anthologies. Her feminist essays are still in print."
  },
  "Lewis Carroll": {
    "img": "https://poemanalysis.com/wp-content/uploads/2023/09/Lewis-Carroll-Portrait.jpg",
    "desc": "Charles Lutwidge Dodgson (27 January 1832 – 14 January 1898), better known by his pen name Lewis Carroll, was an English author, poet, mathematician, photographer and Anglican deacon. His most notable works are Alice's Adventures in Wonderland (1865) and its sequel Through the Looking-Glass (1871). He was noted for his facility with word play, logic, and fantasy. His poems Jabberwocky (1871) and The Hunting of the Snark (1876) are classified in the genre of literary nonsense. Some of Alice's nonsensical wonderland logic reflects his published work on mathematical logic."
  },
  "Lord Alfred Tennyson": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/8/89/Alfred%2C_Lord_Tennyson_by_Elliott_%26_Fry_-_Original.jpg",
    "desc": "Alfred Tennyson, 1st Baron Tennyson, FRS (6 August 1809 – 6 October 1892), was an English poet. He was the Poet Laureate during much of Queen Victoria's reign. In 1829, Tennyson was awarded the Chancellor's Gold Medal at Cambridge for one of his first pieces, \"Timbuktu\". He published his first solo collection of poems, Poems, Chiefly Lyrical, in 1830. \"Claribel\" and \"Mariana\", which remain some of Tennyson's most celebrated poems, were included in this volume. Although described by some critics as overly sentimental, his poems ultimately proved popular and brought Tennyson to the attention of well-known writers of the day, including Samuel Taylor Coleridge. Tennyson's early poetry, with its medievalism and powerful visual imagery, was a major influence on the Pre-Raphaelite Brotherhood."
  },
  "Louisa May Alcott": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/8/82/Louisa_May_Alcott%2C_c._1870_-_Warren%27s_Portraits%2C_Boston.jpg",
    "desc": "Louisa May Alcott (November 29, 1832 – March 6, 1888) was an American novelist, short story writer, and poet best known for writing the novel Little Women (1868) and its sequels Good Wives (1869), Little Men (1871), and Jo's Boys (1886). Raised in New England by her transcendentalist parents, Abigail May and Amos Bronson Alcott, she grew up among many well-known intellectuals of the day, including Margaret Fuller, Ralph Waldo Emerson, Nathaniel Hawthorne, and Henry David Thoreau. Encouraged by her family, Louisa began writing from an early age."
  },
  "Major Henry Livingston, Jr.": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/6/66/Henry_Livingston_Jr.jpg",
    "desc": "Henry Beekman Livingston Jr. (October 13, 1748 – February 29, 1828) was an American poet, and has been proposed as being the uncredited author of the 1823 poem A Visit from St. Nicholas, more popularly known (after its first line) as The Night Before Christmas. Credit for the poem was taken in 1837 by Clement Clarke Moore, a Bible scholar in New York City, nine years after Livingston's death. It was not until a further twenty years had passed that the Livingston family knew of Moore's claim, and it was not until 1900 that they went public with their own claim. Since then, the question has been repeatedly raised and argued by experts on both sides."
  },
  "Mark Twain": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Mark_Twain_by_AF_Bradley.jpg",
    "desc": "Samuel Langhorne Clemens (November 30, 1835 – April 21, 1910), known by the pen name Mark Twain, was an American writer, humorist, and essayist. He was praised as the \"greatest humorist the United States has produced,\" with William Faulkner calling him \"the father of American literature.\" Twain's novels include The Adventures of Tom Sawyer (1876) and its sequel, Adventures of Huckleberry Finn (1884), with the latter often called the \"Great American Novel.\" He also wrote A Connecticut Yankee in King Arthur's Court (1889) and Pudd'nhead Wilson (1894) and cowrote The Gilded Age: A Tale of Today (1873) with Charles Dudley Warner."
  },
  "Mary Elizabeth Coleridge": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Mary_Elizabeth_Coleridge.jpg",
    "desc": "Mary Coleridge (23 September 1861 – 25 August 1907) was a British novelist and poet who also wrote essays and reviews. She wrote poetry under the pseudonym Anodos (a name taken from George MacDonald). Other influences on her were Richard Watson Dixon and Christina Rossetti. Robert Bridges, the Poet Laureate, described her poems as 'wondrously beautiful… but mystical rather than enigmatical'."
  },
  "Matthew Arnold": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Matthew_Arnold.jpg",
    "desc": "Matthew Arnold (24 December 1822 – 15 April 1888) was an English poet and cultural critic. He was the son of Thomas Arnold, the headmaster of Rugby School, and brother to both Tom Arnold, literary professor, and William Delafield Arnold, novelist and colonial administrator. He has been characterised as a sage writer, a type of writer who chastises and instructs the reader on contemporary social issues. He was also an inspector of schools for thirty-five years, and supported the concept of state-regulated secondary education."
  },
  "Matthew Prior": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/0/08/Matthew_Prior_by_Thomas_Hudson.jpg",
    "desc": "Matthew Prior (21 July 1664 – 18 September 1721) was an English poet and diplomat. He is also known as a contributor to The Examiner."
  },
  "Michael Drayton": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/f/f8/MichaelDrayton.jpg",
    "desc": "Michael Drayton (b. 1563 – d. 1631) was an English poet who came to prominence in the Elizabethan era, continuing to write through the reign of James I and into the reign of Charles I. Many of his works consisted of historical poetry. He was also the first English-language author to write odes in the style of Horace. He died on 23 December 1631 in London."
  },
  "Oliver Goldsmith": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/f/f0/Oliver_Goldsmith_by_Sir_Joshua_Reynolds.jpg",
    "desc": "Oliver Goldsmith (10 November 1728 – 4 April 1774) was an Anglo-Irish writer best known for his works The Vicar of Wakefield (1766), The Good-Natur'd Man (1768), The Deserted Village (1770) and She Stoops to Conquer (1771). He is thought by some to have written the classic children's tale The History of Little Goody Two-Shoes (1765)."
  },
  "Oliver Wendell Holmes": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/6/6a/HOLMES%2C_OLIVER_W._JUSTICE_%28cropped%29.jpg",
    "desc": "Oliver Wendell Holmes Jr. (March 8, 1841 – March 6, 1935) was an American jurist who served as an associate justice of the U.S. Supreme Court from 1902 to 1932. Holmes is one of the most widely cited and influential Supreme Court justices in American history, noted for his long tenure on the Court and for his pithy opinions—particularly those on civil liberties and American constitutional democracy—and deference to the decisions of elected legislatures. Holmes retired from the Court at the age of 90, an unbeaten record for oldest justice on the Supreme Court. He previously served as a Brevet Colonel in the American Civil War, in which he was wounded three times, as an associate justice and chief justice of the Massachusetts Supreme Judicial Court, and as Weld Professor of Law at his alma mater, Harvard Law School. His positions, distinctive personality, and writing style made him a popular figure, especially with American progressives."
  },
  "Oscar Wilde": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/4/44/Oscar_Wilde_by_Napoleon_Sarony._Three-quarter-length_photograph%2C_seated.jpg",
    "desc": "Oscar Fingal O'Fflahertie Wills Wilde (16 October 1854 – 30 November 1900) was an Irish poet and playwright. After writing in different forms throughout the 1880s, he became one of the most popular playwrights in London in the early 1890s. He is best remembered for his epigrams and plays, his novel The Picture of Dorian Gray, and his criminal conviction for gross indecency for homosexual acts."
  },
  "Paul Laurence Dunbar": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/a/af/Paul_Laurence_Dunbar_circa_1890.jpg",
    "desc": "Paul Laurence Dunbar (June 27, 1872 – February 9, 1906) was an American poet, novelist, and short story writer of the late 19th and early 20th centuries. Born in Dayton, Ohio, to parents who had been enslaved in Kentucky before the American Civil War, Dunbar began writing stories and verse when he was a child. He published his first poems at the age of 16 in a Dayton newspaper, and served as president of his high school's literary society."
  },
  "Percy Bysshe Shelley": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/5/57/Percy_Bysshe_Shelley_by_Alfred_Clint.jpg",
    "desc": "Percy Bysshe Shelley (4 August 1792 – 8 July 1822) was an English writer who is considered one of the major English Romantic poets. A radical in his poetry as well as in his political and social views, Shelley did not achieve fame during his lifetime, but recognition of his achievements in poetry grew steadily following his death, and he became an important influence on subsequent generations of poets, including Robert Browning, Algernon Charles Swinburne, Thomas Hardy, and W. B. Yeats. American literary critic Harold Bloom describes him as \"a superb craftsman, a lyric poet without rival, and surely one of the most advanced sceptical intellects ever to write a poem.\""
  },
  "Philip Freneau": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/1/14/Philip_freneau.jpg",
    "desc": "Philip Morin Freneau (January 2, 1752 – December 18, 1832) was an American poet, nationalist, polemicist, sea captain and early American newspaper editor sometimes called the \"Poet of the American Revolution\". Through his Philadelphia newspaper, the National Gazette, he was a strong critic of George Washington and a proponent of Jeffersonian policies."
  },
  "Phillis Wheatley": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/e/ef/Phillis_Wheatley_frontispiece.jpg",
    "desc": "Phillis Wheatley Peters, also spelled Phyllis and Wheatly (c. 1753 – December 5, 1784) was an American author who is considered the first African-American author of a published book of poetry. Born in West Africa, she was kidnapped and subsequently sold into slavery at the age of seven or eight and transported to North America, where she was bought by the Wheatley family of Boston. After she learned to read and write, they encouraged her poetry when they saw her talent."
  },
  "Ralph Waldo Emerson": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/4/4b/Ralph_Waldo_Emerson_by_Josiah_Johnson_Hawes_1857.jpg",
    "desc": "Ralph Waldo Emerson (May 25, 1803 – April 27, 1882), who went by his middle name Waldo, was an American essayist, lecturer, philosopher, abolitionist, and poet who led the Transcendentalist movement of the mid-19th century. He was seen as a champion of individualism and critical thinking, as well as a prescient critic of the countervailing pressures of society and conformity. Friedrich Nietzsche thought he was \"the most gifted of the Americans,\" and Walt Whitman called Emerson his \"master\"."
  },
  "Richard Crashaw": {
    "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTfHsKMRH-8JCLVmec3pG8ovLv9bH23gzJahviCFSVrdbgNqVd5KBfKWH__xMujn6CVzNkAIJP_n8GnGyarC3y3JQ",
    "desc": "Richard Crashaw (c. 1613 – 21 August 1649) was an English poet, teacher, High Church Anglican cleric and Roman Catholic convert, who was one of the major metaphysical poets in 17th-century English literature."
  },
  "Richard Lovelace": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/5/57/RichardLovelace.jpg",
    "desc": "Richard Lovelace (homophone of \"loveless\"; 9 December 1617 – 1657) was an English poet in the seventeenth century. He was a cavalier poet who fought on behalf of Charles I during the English Civil War. His best known works are \"To Althea, from Prison\", and \"To Lucasta, Going to the Warres\"."
  },
  "Robert Browning": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/5/58/Robert_Browning_by_Herbert_Rose_Barraud_c1888.jpg",
    "desc": "Robert Browning (7 May 1812 – 12 December 1889) was an English poet and playwright whose dramatic monologues put him high among the Victorian poets. He was noted for irony, characterization, dark humour, social commentary, historical settings and challenging vocabulary and syntax."
  },
  "Robert Burns": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/PG_1063Burns_Naysmith_%28cropped%29.jpg/440px-PG_1063Burns_Naysmith_%28cropped%29.jpg",
    "desc": "Robert Burns (25 January 1759 – 21 July 1796), also known familiarly as Rabbie Burns, was a Scottish poet and lyricist. He is widely regarded as the national poet of Scotland and is celebrated worldwide. He is the best known of the poets who have written in the Scots language, although much of his writing is in a \"light Scots dialect\" of English, accessible to an audience beyond Scotland. He also wrote in standard English, and in these writings his political or civil commentary is often at its bluntest."
  },
  "Robert Herrick": {
    "img": "https://ebbg7broonn.exactdn.com/wp-content/uploads/2023/10/Robert-Herrick-Portrait.jpg?strip=all&lossy=1&ssl=1",
    "desc": "Robert Herrick (baptised 24 August 1591 – buried 15 October 1674) was a 17th-century English lyric poet and Anglican cleric. He is best known for Hesperides, a book of poems. This includes the carpe diem poem \"To the Virgins, to Make Much of Time\", with the first line \"Gather ye rosebuds while ye may\"."
  },
  "Robert Louis Stevenson": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/7/7a/Robert_Louis_Stevenson_by_Henry_Walter_Barnett_bw.jpg",
    "desc": "Robert Louis Stevenson (born Robert Lewis Balfour Stevenson; 13 November 1850 – 3 December 1894) was a Scottish novelist, essayist, poet and travel writer. He is best known for works such as Treasure Island, Strange Case of Dr Jekyll and Mr Hyde, Kidnapped and A Child's Garden of Verses."
  },
  "Robert Southey": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/a/a8/Robert_Southey_%281774%E2%80%931843%29%2C_Aged_31_John_Opie_%281761%E2%80%931807%29_Keswick_Museum.jpg",
    "desc": "Robert Southey (12 August 1774 – 21 March 1843) was an English poet of the Romantic school, and Poet Laureate from 1813 until his death. Like the other Lake Poets, William Wordsworth and Samuel Taylor Coleridge, Southey began as a radical but became steadily more conservative as he gained respect for Britain and its institutions. Other romantics such as Byron accused him of siding with the establishment for money and status. He is remembered especially for the poem \"After Blenheim\" and the original version of \"Goldilocks and the Three Bears\"."
  },
  "Robinson": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/8/89/Gainsborough_Mary-Robinson.jpg",
    "desc": "Mary Robinson (née Darby; 27 November 1757 – 26 December 1800) was an English actress, poet, dramatist, novelist, and celebrity figure. She lived in England, in the cities of Bristol and London; she also lived in France and Germany for a time. She enjoyed poetry from the age of seven and started working, first as a teacher and then as actress, from the age of 14. She wrote many plays, poems and novels. She was a celebrity, gossiped about in newspapers, famous for her acting and writing. During her lifetime she was known as \"the English Sappho\". She earned her nickname \"Perdita\" for her role as Perdita (heroine of Shakespeare's The Winter's Tale) in 1779. She was the first public mistress of King George IV while he was still Prince of Wales."
  },
  "Rupert Brooke": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/7/7a/For_remembrance%2C_soldier_poets_who_have_fallen_in_the_war%2C_Adcock%2C_1920_DJVU_pg_10.jpg",
    "desc": "Rupert Chawner Brooke (3 August 1887 – 23 April 1915) was an English poet known for his idealistic war sonnets written during the First World War, especially \"The Soldier\". He was also known for his boyish good looks, which were said to have prompted the Irish poet W. B. Yeats to describe him as \"the handsomest young man in England\". He died of septicaemia following a mosquito bite whilst aboard a French hospital ship moored off the island of Skyros in the Aegean Sea."
  },
  "Samuel Coleridge": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/9/91/SamuelTaylorColeridge.jpg",
    "desc": "Samuel Taylor Coleridge ( 21 October 1772 – 25 July 1834) was an English poet, literary critic, philosopher, and theologian who was a founder of the Romantic Movement in England and a member of the Lake Poets with his friend William Wordsworth. He also shared volumes and collaborated with Charles Lamb, Robert Southey, and Charles Lloyd."
  },
  "Samuel Johnson": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/2/20/Samuel_Johnson_by_Joshua_Reynolds.jpg",
    "desc": "Samuel Johnson (18 September 1709 – 13 December 1784), often called Dr Johnson, was an English writer who made lasting contributions as a poet, playwright, essayist, moralist, literary critic, sermonist, biographer, editor, and lexicographer. The Oxford Dictionary of National Biography calls him \"arguably the most distinguished man of letters in English history\"."
  },
  "Sarah Flower Adams": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/c/c9/SarahFlowerAdams.jpg",
    "desc": "Sarah Fuller Flower Adams (or Sally Adams) (22 February 1805 – 14 August 1848) was an English poet and hymnwriter. A selection of hymns she wrote, published by William Johnson Fox, included her best-known one, \"Nearer, My God, to Thee\", reportedly played by the band as the RMS Titanic sank in 1912."
  },
  "Sidney Lanier": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/5/53/Sidney_Lanier_-_Project_Gutenberg_eText_16622.jpg",
    "desc": "Sidney Clopton Lanier (February 3, 1842 – September 7, 1881) was an American musician, poet and author. He served in the Confederate States Army as a private, worked on a blockade-running ship for which he was imprisoned (resulting in his catching tuberculosis), taught, worked at a hotel where he gave musical performances, was a church organist, and worked as a lawyer. As a poet he sometimes used dialects. Many of his poems are written in heightened, but often archaic, American English. He became a flautist and sold poems to publications. He eventually became a professor of literature at Johns Hopkins University in Baltimore, and is known for his adaptation of musical meter to poetry. Many schools, other structures and two lakes are named for him, and he became hailed in the South as the \"poet of the Confederacy\". A 1972 US postage stamp honored him as an \"American poet\"."
  },
  "Sir John Suckling": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/3/38/Suckling.jpg",
    "desc": "Sir John Suckling (10 February 1609 – after May 1641) was an English poet, prominent among those renowned for careless gaiety and wit – the accomplishments of a cavalier poet. He also invented the card game cribbage. He is best known for his poem \"Ballade upon a Wedding\"."
  },
  "Sir Philip Sidney": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Sir_Philip_Sidney_from_NPG.jpg",
    "desc": "Sir Philip Sidney (30 November 1554 – 17 October 1586) was an English poet, courtier, scholar and soldier who is remembered as one of the most prominent figures of the Elizabethan age."
  },
  "Sir Thomas Wyatt": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/c/c8/Sir_Thomas_Wyatt_%281%29_by_Hans_Holbein_the_Younger.jpg",
    "desc": "Sir Thomas Wyatt (1503 – 11 October 1542) was a 16th-century English politician, ambassador, and lyric poet credited with introducing the sonnet to English literature. He was born at Allington Castle near Maidstone in Kent, though the family was originally from Yorkshire. His family adopted the Lancastrian side in the Wars of the Roses. His mother was Anne Skinner, and his father Henry, who had earlier been imprisoned and tortured by Richard III, had been a Privy Councillor of Henry VII and remained a trusted adviser when Henry VIII ascended the throne in 1509."
  },
  "Sir Walter Raleigh": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Sir_Walter_Ralegh_by_%27H%27_monogrammist.jpg",
    "desc": "Sir Walter Raleigh (c. 1553 – 29 October 1618) was an English statesman, soldier, writer and explorer. One of the most notable figures of the Elizabethan era, he played a leading part in English colonisation of North America, suppressed rebellion in Ireland, helped defend England against the Spanish Armada and held political positions under Elizabeth I."
  },
  "Sir Walter Scott": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/1/11/Sir_Thomas_Lawrence_%281769-1830%29_-_Sir_Walter_Scott_%281771-1832%29_-_RCIN_400644_-_Royal_Collection.jpg",
    "desc": "Sir Walter Scott, 1st Baronet FRSE FSAScot (15 August 1771 – 21 September 1832), was a Scottish novelist, poet and historian. Many of his works remain classics of European and Scottish literature, notably the novels Ivanhoe (1819), Rob Roy (1817), Waverley (1814), Old Mortality (1816), The Heart of Mid-Lothian (1818), and The Bride of Lammermoor (1819), along with the narrative poems Marmion (1808) and The Lady of the Lake (1810). He had a major impact on European and American literature."
  },
  "Stephen Crane": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/6/6c/SCrane2.JPG",
    "desc": "Stephen Crane (November 1, 1871 – June 5, 1900) was an American poet, novelist, and short story writer. Prolific throughout his short life, he wrote notable works in the Realist tradition as well as early examples of American Naturalism and Impressionism. He is recognized by modern critics as one of the most innovative writers of his generation."
  },
  "Thomas Campbell": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Thomas_Campbell_by_Sir_Thomas_Lawrence.jpg",
    "desc": "Thomas Campbell (27 July 1777 – 15 June 1844) was a Scottish poet. He was a founder and the first President of the Clarence Club and a co-founder of the Literary Association of the Friends of Poland; he was also one of the initiators of a plan to found what became University College London. In 1799 he wrote Pleasures of Hope, a traditional 18th-century didactic poem in heroic couplets. He also produced several patriotic war songs— \"Ye Mariners of England\", \"The Soldier's Dream\", \"Hohenlinden\" and, in 1801, The Battle of the Baltic, but was no less at home in delicate lyrics such as \"At Love's Beginning\"."
  },
  "Thomas Chatterton": {
    "img": "https://britton-images.com/wp-content/uploads/2023/03/Thomas-Chatterton-1752-1770-English-poet-whose-precocious-talents-ended-in-suicide-at-age-17.-He-was-an-influence-on-Romantic-artists-of-the-period-such-as-Shelley-Keats-Wordsworth-and-Coleridge.jpg",
    "desc": "Thomas Chatterton (20 November 1752 – 24 August 1770) was an English poet whose precocious talents ended in suicide at age 17. He was an influence on Romantic artists of the period such as Shelley, Keats, Wordsworth and Coleridge."
  },
  "Thomas Flatman": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Thomasflatman.jpg",
    "desc": "Thomas Flatman (21 February 1635 – 8 December 1688) was an English poet and miniature painter. There were several editions of his Poems and Songs (1674). One of his self-portraits is in the Victoria and Albert Museum. A portrait of Charles II is in the Wallace Collection, London. His miniatures are noted for their vitality."
  },
  "Thomas Gray": {
    "img": "https://ebbg7broonn.exactdn.com/wp-content/uploads/2023/11/Thomas-Gray-Portrait.jpg?strip=all&lossy=1&ssl=1",
    "desc": "Thomas Gray (26 December 1716 – 30 July 1771) was an English poet, letter-writer, and classical scholar at Cambridge University, being a fellow first of Peterhouse then of Pembroke College. He is widely known for his Elegy Written in a Country Churchyard, published in 1751."
  },
  "Thomas Hood": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/1/12/Thomas_Hood_from_NPG.jpg",
    "desc": "Thomas Hood (23 May 1799 – 3 May 1845) was an English poet, author and humorist, best known for poems such as \"The Bridge of Sighs\" and \"The Song of the Shirt\". Hood wrote regularly for The London Magazine, Athenaeum, and Punch. He later published a magazine largely consisting of his own works. Hood, never robust, had lapsed into invalidism by the age of 41 and died at the age of 45. William Michael Rossetti in 1903 called him \"the finest English poet\" between the generations of Shelley and Tennyson. Hood was the father of the playwright and humorist Tom Hood (1835–1874) and the children's writer Frances Freeling Broderip (1830–1878)."
  },
  "Thomas Moore": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/c/c6/Thomas_Moore%2C_after_Thomas_Lawrence.jpg",
    "desc": "Thomas Moore (28 May 1779 – 25 February 1852), was an Irish writer, poet, and lyricist celebrated for his Irish Melodies. His setting of English-language verse to old Irish tunes marked the transition in popular Irish culture from Irish to English. Politically, Moore was recognised in England as a press, or \"squib\", writer for the aristocratic Whigs; in Ireland he was accounted a Catholic patriot."
  },
  "Thomas Warton": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/7/70/Thomas_Warton_by_Reynolds.jpg",
    "desc": "Thomas Warton (9 January 1728 – 21 May 1790) was an English literary historian, critic, and poet. He was appointed Poet Laureate in 1785, following the death of William Whitehead."
  },
  "Walt Whitman": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Walt_Whitman_-_George_Collins_Cox.jpg",
    "desc": "Walter Whitman Jr. (May 31, 1819 – March 26, 1892) was an American poet, essayist, and journalist. He is considered one of the most influential poets in American literature. Whitman incorporated both transcendentalism and realism in his writings and is often called the father of free verse. His work was controversial in his time, particularly his 1855 poetry collection Leaves of Grass, which was described by some as obscene for its overt sensuality."
  },
  "Walter Savage Landor": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/a/aa/Portrait_of_Walter_Savage_Landor_%284673349%29_%28cropped%29.jpg",
    "desc": "Walter Savage Landor (30 January 1775 – 17 September 1864) was an English writer, poet, and activist. His best known works were the prose Imaginary Conversations, and the poem \"Rose Aylmer,\" but the critical acclaim he received from contemporary poets and reviewers was not matched by public popularity. As remarkable as his work was, it was equalled by his rumbustious character and lively temperament. Both his writing and political activism, such as his support for Lajos Kossuth and Giuseppe Garibaldi, were imbued with his passion for liberal and republican causes. He befriended and influenced the next generation of literary reformers such as Charles Dickens and Robert Browning."
  },
  "Wilfred Owen": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Wilfred_Owen_%C3%A0_l%27Arrouaise.jpg",
    "desc": "Wilfred Edward Salter Owen MC (18 March 1893 – 4 November 1918) was an English poet and soldier. He was one of the leading poets of the First World War. His war poetry on the horrors of trenches and gas warfare was much influenced by his mentor Siegfried Sassoon and stood in contrast to the public perception of war at the time and to the confidently patriotic verse written by earlier war poets such as Rupert Brooke. Among his best-known works – most of which were published posthumously – are \"Dulce et Decorum est\", \"Insensibility\", \"Anthem for Doomed Youth\", \"Futility\", \"Spring Offensive\" and \"Strange Meeting\". Owen was killed in action on 4 November 1918, a week before the war's end, at the age of 25."
  },
  "William Allingham": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/c/c6/William_Allingham_Photo.jpg",
    "desc": "William Allingham (19 March 1824 – 18 November 1889) was an Irish poet, diarist and editor. He wrote several volumes of lyric verse, and his poem \"The Faeries\" was much anthologised. But he is better known for his posthumously published Diary, in which he records his lively encounters with Tennyson, Carlyle and other writers and artists. His wife, Helen Allingham, was a well-known watercolourist and illustrator."
  },
  "William Barnes": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/4/4e/William_Barnes_poet.jpg",
    "desc": "William Barnes (22 February 1801 – 7 October 1886) was an English polymath, writer, poet, philologist, priest, mathematician, engraving artist and inventor. He wrote over 800 poems, some in Dorset dialect, and much other work, including a comprehensive English grammar quoting from more than 70 different languages. A linguistic purist, Barnes strongly advocated against borrowing foreign words into English, and instead supported the use and proliferation of \"strong old Anglo-Saxon speech\"."
  },
  "William Blake": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/0/00/William_Blake_by_Thomas_Phillips.jpg",
    "desc": "William Blake (28 November 1757 – 12 August 1827) was an English poet, painter, and printmaker. Largely unrecognised during his life, Blake has become a seminal figure in the history of the poetry and visual art of the Romantic Age. What he called his \"prophetic works\" were said by 20th-century critic Northrop Frye to form \"what is in proportion to its merits the least read body of poetry in the English language\". While he lived in London his entire life, except for three years spent in Felpham, he produced a diverse and symbolically rich collection of works, which embraced the imagination as \"the body of God\",or \"human existence itself\"."
  },
  "William Browne": {
    "img": "https://history.rcp.ac.uk/sites/default/files/styles/webp_format/public/2019-11/Browne_William-min.webp?itok=QDks0U0B",
    "desc": "William Browne (c. 1590 – c. 1645) was an English pastoral poet, born at Tavistock, Devon, and educated at Exeter College, Oxford; subsequently he entered the Inner Temple."
  },
  "William Cowper": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/4/45/William_Cowper_by_Lemuel_Francis_Abbott.jpg",
    "desc": "William Cowper ( 15 November 1731 (Julian) / 26 November 1731 (Gregorian) – 14 April 1800 (Julian) / 25 April 1800 (Gregorian)) was an English poet and Anglican hymnwriter."
  },
  "William Cullen Bryant": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/0/0f/William_Cullen_Bryant_Cabinet_Card_by_Mora-crop.jpg",
    "desc": "William Cullen Bryant (November 3, 1794 – June 12, 1878) was an American romantic poet, journalist, and long-time editor of the New York Evening Post. Born in Massachusetts, he started his career as a lawyer but showed an interest in poetry early in his life."
  },
  "William Ernest Henley": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/0/0b/William_Ernest_Henley_young.jpg",
    "desc": "William Ernest Henley (23 August 1849  – 11 July 1903) was a British poet, writer, critic and editor. Though he wrote several books of poetry, Henley is remembered most often for his 1875 poem \"Invictus\". A fixture in London literary circles, the one-legged Henley was an inspiration for Robert Louis Stevenson's character Long John Silver (Treasure Island, 1883), while his young daughter Margaret Henley inspired J. M. Barrie's choice of the name Wendy for the heroine of his play Peter Pan (1904)."
  },
  "William Lisle Bowles": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/c/c6/William_Lisle_Bowles.jpg",
    "desc": "William Lisle Bowles (24 September 1762 – 7 April 1850) was an English priest, poet and critic."
  },
  "William Morris": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/8/8a/William_Morris_age_53.jpg",
    "desc": "William Morris (24 March 1834 – 3 October 1896) was an English textile designer, poet, artist, writer, and socialist activist associated with the British Arts and Crafts movement. He was a major contributor to the revival of traditional British textile arts and methods of production. His literary contributions helped to establish the modern fantasy genre, while he helped win acceptance of socialism in fin de siècle Great Britain."
  },
  "William Shakespeare": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/2/21/William_Shakespeare_by_John_Taylor%2C_edited.jpg",
    "desc": "William Shakespeare (c. 23 April 1564 – 23 April 1616) was an English playwright, poet and actor. He is widely regarded as the greatest writer in the English language and the world's pre-eminent dramatist. He is often called England's national poet and the \"Bard of Avon\" (or simply \"the Bard\"). His extant works, including collaborations, consist of some 39 plays, 154 sonnets, three long narrative poems and a few other verses, some of uncertain authorship. His plays have been translated into every major living language and are performed more often than those of any other playwright. Shakespeare remains arguably the most influential writer in the English language, and his works continue to be studied and reinterpreted."
  },
  "William Topaz McGonagall": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/3/36/William_McGonagall.jpg",
    "desc": "William McGonagall (March 1825 – 29 September 1902) was a Scottish poet and public performer. He gained notoriety as an extremely bad poet who exhibited no recognition of, or concern for, his peers' opinions of his work."
  },
  "William Vaughn Moody": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Portrait_of_William_Vaughn_Moody.jpg",
    "desc": "William Vaughn Moody (July 8, 1869 – October 17, 1910) was an American dramatist and poet. Moody was author of The Great Divide, first presented under the title of The Sabine Woman at the Garrick Theatre in Chicago on April 12, 1906, and then on Broadway at the Princess Theatre, running for 238 performances from October 3, 1906, to March 24, 1907. His poetic dramas are The Masque of Judgment (1900), The Fire Bringer (1904), and The Death of Eve (left undone at his death). His best-known poem is \"An Ode in Time of Hesitation,\" on the Spanish-American War; others include \"Gloucester Moor,\" \"On a Soldier Fallen in the Philippines,\" \"The Brute,\" \"Harmonics\" (his only sonnet), \"Until the Troubling of the Waters,\" \"The Departure,\" \"How the Mead-Slave Was Set Free,\" \"The Daguerreotype,\" and \"The Death of Eve.\" His poems everywhere bespeak the social conscience of the progressive era (1893–1916) in which he spent his foreshortened life. In style they evoke a mastery of the verse-craft of his time and also the reach and depth derived from his intensive studies of Milton and of Greek tragedy."
  },
  "William Wordsworth": {
    "img": "https://upload.wikimedia.org/wikipedia/commons/5/59/British_%28English%29_School_-_William_Wordsworth_%281770%E2%80%931850%29_-_866458_-_National_Trust.jpg",
    "desc": "William Wordsworth (7 April 1770 – 23 April 1850) was an English Romantic poet who, with Samuel Taylor Coleridge, helped to launch the Romantic Age in English literature with their joint publication Lyrical Ballads (1798)."
  }
}
